quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_spi_regs.h
/*
 * mml_spi_regs.h --
 *
 * ----------------------------------------------------------------------------
 * Copyright (c) 2013, Maxim Integrated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of the <organization> nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY MAXIM INTEGRATED ''AS IS'' AND ANY
 * EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
 * ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/* [INTERNAL] ------------------------------------------------------------------
 * Created on: Oct 21, 2013
 * Author: Yann G. <yann.gaude@maximintegrated.com>
 *
 * ---- Subversion keywords (need to set the keyword property)
 * $Revision:: $: Revision of last commit
 * $Author:: $: Author of last commit
 * $Date:: $: Date of last commit
 * [/INTERNAL] -------------------------------------------------------------- */

#ifndef _MML_SPI_REGS_H_
#define _MML_SPI_REGS_H_

/** @file mml_spi_regs.h SPI Registers Header */

/** @defgroup MML_SPI SPI Driver */

/** @defgroup MML_SPI_REGS SPI Registers
 *
 * @note SPI IP or Specification version number
 *
 * @ingroup MML_SPI
 * @{
 */
/** @defgroup MML_SPI_REGS_DR Data Register (DR)
 *
 * @li DATA [15:0]	- R/W: data
 * @li RFU [31:16]	- R: reserved
 * @{
 */
#define MML_SPI_DATA_OFST						0x00000000 //!< Register offset
#define MML_SPI_DATA_DFLT						0x00000000 //!< Register default value
/* Bits Fields */
#define MML_SPI_DATA_DATA_OFST					0 //!< DATA offset
#define MML_SPI_DATA_DATA_MASK_NOOFST			0xffff //!< DATA mask no offset
#define MML_SPI_DATA_DATA_MASK					( MML_SPI_DATA_DATA_MASK_NOOFST << MML_SPI_DATA_DATA_OFST ) //!< DATA mask
#define MML_SPI_DATA_RFU_MASK					~MML_SPI_DATA_DATA_MASK //!< RFU mask
/** @} */ /* @defgroup MML_SPI_REGS_DR */

/** @defgroup MML_SPI_REGS_CR Control Register (CR)
 *
 * @li SPIEN [0]	- R/W: SPI enable
 * @li MMEN [1]		- R/W: SPI master mode enable
 * @li WOR [2]		- R/W: wire-OR
 * @li CLKPOL [3]	- R/W: clock polarity
 * @li PHASE [4]	- R/W: phase select
 * @li BIRQ [5]		- R/W: BRG timer interrupt request
 * @li STR [6]		- R/W: start an SPI interrupt request
 * @li IRQE [7]		- R/W: interrupt request enable
 * @li RFU [31:8]	- R: reserved
 *
 * @{
 */
#define MML_SPI_CR_OFST							0x00000004 //!< Register offset
#define MML_SPI_CR_DFLT							0x00000000 //!< Register default value
/* Bits Fields */
#define MML_SPI_CR_SPIEN_OFST					0 //!< SPIEN offset
#define MML_SPI_CR_SPIEN_MASK_NOOFST			0x1 //!< SPIEN mask no offset
#define MML_SPI_CR_SPIEN_MASK					( MML_SPI_CR_SPIEN_MASK_NOOFST << MML_SPI_CR_SPIEN_OFST ) //!< SPIEN mask

#define MML_SPI_CR_MMEN_OFST					1 //!< MMEN offset
#define MML_SPI_CR_MMEN_MASK_NOOFST				0x1 //!< MMEN mask
#define MML_SPI_CR_MMEN_MASK					( MML_SPI_CR_MMEN_MASK_NOOFST << MML_SPI_CR_MMEN_OFST ) //!< MMEN mask

#define MML_SPI_CR_WOR_OFST						2 //!< WOR offset
#define MML_SPI_CR_WOR_MASK_NOOFST				0x1 //!< WOR mask no offset
#define MML_SPI_CR_WOR_MASK						( MML_SPI_CR_WOR_MASK_NOOFST << MML_SPI_CR_WOR_OFST ) //!< WOR mask

#define MML_SPI_CR_CLKPOL_OFST					3 //!< CLKPOL offset
#define MML_SPI_CR_CLKPOL_MASK_NOOFST			0x1 //!< CLKPOL mask no offset
#define MML_SPI_CR_CLKPOL_MASK					( MML_SPI_CR_CLKPOL_MASK_NOOFST << MML_SPI_CR_CLKPOL_OFST ) //!< CLKPOL mask

#define MML_SPI_CR_PHASE_OFST					4 //!< PHASE offset
#define MML_SPI_CR_PHASE_MASK_NOOFST			0x1 //!< PHASE mask no offset
#define MML_SPI_CR_PHASE_MASK					( MML_SPI_CR_PHASE_MASK_NOOFST << MML_SPI_CR_PHASE_OFST ) //!< PHASE mask

#define MML_SPI_CR_BIRQ_OFST					5 //!< BIRQ offset
#define MML_SPI_CR_BIRQ_MASK_NOOFST				0x1 //!< BIRQ mask no offset
#define MML_SPI_CR_BIRQ_MASK					( MML_SPI_CR_BIRQ_MASK_NOOFST << MML_SPI_CR_BIRQ_OFST ) //!< BIRQ mask

#define MML_SPI_CR_STR_OFST						6 //!< STR offset
#define MML_SPI_CR_STR_MASK_NOOFST				0x1 //!< STR mask no offset
#define MML_SPI_CR_STR_MASK						( MML_SPI_CR_STR_MASK_NOOFST << MML_SPI_CR_STR_OFST ) //!< STR mask

#define MML_SPI_CR_IRQE_OFST					7 //!< IRQE offset
#define MML_SPI_CR_IRQE_MASK_NOOFST				0x1 //!< IRQE mask no offset
#define MML_SPI_CR_IRQE_MASK					( MML_SPI_CR_IRQE_MASK_NOOFST << MML_SPI_CR_IRQE_OFST ) //!< IRQE mask

#define MML_SPI_CR_RFU_OFST						8 //!< RFU offset
#define MML_SPI_CR_RFU_MASK						0xffffff00 //!< RFU mask

/* Enumeration of the different value for a bits field . We recommend to use
 * human readable value. */

#define MML_SPI_CR_SPIEN_DISABLE				0 //!< SPI disabled
#define MML_SPI_CR_SPIEN_ENABLE					1 //!< SPI enabled

#define MML_SPI_CR_MODE_SLAVE					0 //!< Slave mode
#define MML_SPI_CR_MODE_MASTER					1 //!< Master mode

#define MML_SPI_IO_OPEN_DRAIN_DISABLE			0 //!< SPI signals not configured
#define MML_SPI_IO_OPEN_DRAIN_ENABLE			1 //!< SPI signals configured

#define MML_SPI_CLOCK_POL_LOW					0 //!< polarity low
#define MML_SPI_CLOCK_POL_HIGH					1 //!< polarity high

#define MML_SPI_CLOCK_PHA_LOW					0 //!< sets the phase of the data to the clock
#define MML_SPI_CLOCK_PHA_HIGH					1

#define MML_SPI_CR_BIRQ_DISABLE					0 //!< SPIEN ='0' disable the baud rate generation else nothing
#define MML_SPI_CR_BIRQ_ENABLE					1 //!< SPIEN ='0' enable the baud rate generation else nothing

#define MML_SPI_CR_STR_0						0
#define MML_SPI_CR_STR_1						1 //!< Sets IRQ='1'in the SPI_STAT

