quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_spi_regs.h
#define MML_SPI_CR_IRQE_DISABLE					0 //!< interrupts disabled
#define MML_SPI_CR_IRQE_ENABLE					1 //!< interrupts enable



/** @} */ /* @defgroup MML_SPI_REGS_CR */

/** @defgroup MML_SPI_REGS_SR Status Register (SR)
 *
 * @li SLAS [0]		- R: slave select
 * @li TXST [1]		- R: transmit status
 * @li TUND [2]		- R/W1C: transmit underrun
 * @li ROVR [3]		- R/W1C: receive overrun
 * @li ABT [4]		- R/W1C: slave mode transaction abort
 * @li COL [5]		- R/W1C: collision
 * @li TOVR [6]		- R/W1C: transmit overrun
 * @li IRQ [7]		- R/W1C: interrupt request
 * @li RFU [31:8]	- R/W1C: reserved
 *
 * @{
 */
#define MML_SPI_SR_OFST							0x00000008 //!< Register offset
#define MML_SPI_SR_DFLT							0x00000001 //!< Register default value

/* Bits Fields */
#define MML_SPI_SR_SLAS_OFST					0 //!< SLAS offset
#define MML_SPI_SR_SLAS_MASK_NOOFST				0x1 //!< SLAS mask no offset
#define MML_SPI_SR_SLAS_MASK					( MML_SPI_SR_SLAS_MASK_NOOFST << MML_SPI_SR_SLAS_OFST ) //!< SLAS mask

#define MML_SPI_SR_TXST_OFST					1 //!< TXST offset
#define MML_SPI_SR_TXST_MASK_NOOFST				0x1 //!< TXST mask
#define MML_SPI_SR_TXST_MASK					( MML_SPI_SR_TXST_MASK_NOOFST << MML_SPI_SR_TXST_OFST ) //!< TXST mask

#define MML_SPI_SR_TUND_OFST					2 //!< TUND offset
#define MML_SPI_SR_TUND_MASK_NOOFST				0x1 //!< TUND mask no offset
#define MML_SPI_SR_TUND_MASK					( MML_SPI_SR_TUND_MASK_NOOFST << MML_SPI_SR_TUND_OFST ) //!< TUND mask

#define MML_SPI_SR_ROVR_OFST					3 //!< ROVR offset
#define MML_SPI_SR_ROVR_MASK_NOOFST				0x1 //!< ROVR mask no offset
#define MML_SPI_SR_ROVR_MASK					( MML_SPI_SR_ROVR_MASK_NOOFST << MML_SPI_SR_ROVR_OFST ) //!< ROVR mask

#define MML_SPI_SR_ABT_OFST						4 //!< ABT offset
#define MML_SPI_SR_ABT_MASK_NOOFST				0x1 //!< ABT mask no offset
#define MML_SPI_SR_ABT_MASK						( MML_SPI_SR_ABT_MASK_NOOFST << MML_SPI_SR_ABT_OFST ) //!< ABT mask

#define MML_SPI_SR_COL_OFST						5 //!< COL offset
#define MML_SPI_SR_COL_MASK_NOOFST				0x1 //!< COL mask
#define MML_SPI_SR_COL_MASK						( MML_SPI_SR_COL_MASK_NOOFST << MML_SPI_SR_COL_OFST ) //!< COL mask

#define MML_SPI_SR_TOVR_OFST					6 //!< TOVR offset
#define MML_SPI_SR_TOVR_MASK_NOOFST				0x1 //!< TOVR mask no offset
#define MML_SPI_SR_TOVR_MASK					( MML_SPI_SR_TOVR_MASK_NOOFST << MML_SPI_SR_TOVR_OFST ) //!< TOVR mask

#define MML_SPI_SR_IRQ_OFST						7 //!< IRQ offset
#define MML_SPI_SR_IRQ_MASK_NOOFST				0x1 //!< IRQ mask no offset
#define MML_SPI_SR_IRQ_MASK						( MML_SPI_SR_IRQ_MASK_NOOFST << MML_SPI_SR_IRQ_OFST ) //!< IRQ mask

#define MML_SPI_SR_RFU_OFST						8 //!< RFU offset

/* Enumeration of the different value for a bits field . We recommend to use
 * human readable value. */

#define MML_SPI_CR_SLAS_0						0 //!< Slave selected (SPI=Slave)
#define MML_SPI_CR_SLAS_1						1 //!< Slave not selected (SPI=Slave)

#define MML_SPI_CR_TXST_0						0 //!< No data transmission
#define MML_SPI_CR_TXST_1						1 //!< data transmission

#define MML_SPI_CR_TUND_0						0 //!< error has not occurred
#define MML_SPI_CR_TUND_1						1 //!< error has occurred

#define MML_SPI_CR_ROVR_0						0 //!< error has not occurred
#define MML_SPI_CR_ROVR_1						1 //!< error has occurred

#define MML_SPI_CR_ABT_0						0 //!< Slave mode not detected
#define MML_SPI_CR_ABT_1						1 //!< Slave mode detected

#define MML_SPI_CR_COL_0						0 //!< fault mode not detected
#define MML_SPI_CR_COL_1						1 //!< fault mode detected

#define MML_SPI_CR_TOVR_0						0 //!< error has not occurred
#define MML_SPI_CR_TOVR_1						1 //!< error has occurred

#define MML_SPI_CR_IRQ_0						0 //!< SPI interrupt not pending
#define MML_SPI_CR_IRQ_1						1 //!< SPI interrupt pending
/** @} */ /* @defgroup MML_SPI_REGS_SR */

/** @defgroup MML_SPI_REGS_MR MODE Register (MR)
 *
 * @li SSV [0]		- R/W: slave select value
 * @li SSIO [1]		- R/W: slave select I/O
 * @li NUMBITS [5:2]- R/W: number of Data Bits per Character to Transfer
 * @li DIAG [6]		- R/W: Diagnostic Mode Control
 * @li TX_LJ [7]	- R/W: Used when NUMBITS !=0
 * @li RFU [31:8]	- R: reserved
 *
 * @{
 */
#define MML_SPI_MR_OFST							0x0000000c //!< Register offset
#define MML_SPI_MR_DFLT							0x00000000 //!< Register default value

/* Bits Fields */
#define MML_SPI_MR_SSV_OFST						0 //!< SSV offset
#define MML_SPI_MR_SSV_MASK_NOOFST				0x1 //!< SSV mask no offset
#define MML_SPI_MR_SSV_MASK						( MML_SPI_MR_SSV_MASK_NOOFST << MML_SPI_MR_SSV_OFST ) //!< SSV mask

#define MML_SPI_MR_SSIO_OFST					1 //!< SSIO offset
#define MML_SPI_MR_SSIO_MASK_NOOFST				0x1 //!< SSIO mask no offset
#define MML_SPI_MR_SSIO_MASK					( MML_SPI_MR_SSIO_MASK_NOOFST << MML_SPI_MR_SSIO_OFST ) //!< SSIO mask

#define MML_SPI_MR_NUMBITS_OFST					2 //!< NUMBITS offset
#define MML_SPI_MR_NUMBITS_MASK_NOOFST			0xf //!< NUMBITS mask no offset
#define MML_SPI_MR_NUMBITS_MASK					( MML_SPI_MR_NUMBITS_MASK_NOOFST << MML_SPI_MR_NUMBITS_OFST ) //!< NUMBITS mask

#define MML_SPI_MR_DIAG_OFST					6 //!< DIAG offset
#define MML_SPI_MR_DIAG_MASK_NOOFST				0x1 //!< DIAG mask no offset
#define MML_SPI_MR_DIAG_MASK					( MML_SPI_MR_DIAG_MASK_NOOFST << MML_SPI_MR_DIAG_OFST ) //!< DIAG mask

#define MML_SPI_MR_TX_LJ_OFST					7 //!< TX_LJ offset
#define MML_SPI_MR_TX_LJ_MASK_NOOFST			0x1 //!< TX_LJ mask no offset
#define MML_SPI_MR_TX_LJ_MASK					( MML_SPI_MR_TX_LJ_MASK_NOOFST << MML_SPI_MR_TX_LJ_OFST ) //!< TX_LJ mask

#define MML_SPI_MR_SSL1_OFST					8 //!< SSL1 offset
#define MML_SPI_MR_SSL1_MASK_NOOFST				0x1 //!< SSL1 mask no offset
#define MML_SPI_MR_SSL1_MASK					( MML_SPI_MR_SSL1_MASK_NOOFST << MML_SPI_MR_SSL1_OFST ) //!< SSL1 mask

#define MML_SPI_MR_SSL2_OFST					9 //!< SSL2 offset
#define MML_SPI_MR_SSL2_MASK_NOOFST				0x1 //!< SSL2 mask no offset
#define MML_SPI_MR_SSL2_MASK					( MML_SPI_MR_SSL2_MASK_NOOFST << MML_SPI_MR_SSL2_OFST ) //!< SSL2 mask

#define MML_SPI_MR_SSL3_OFST					10 //!< SSL3 offset
#define MML_SPI_MR_SSL3_MASK_NOOFST				0x1 //!< SSL3 mask no offset
#define MML_SPI_MR_SSL3_MASK					( MML_SPI_MR_SSL3_MASK_NOOFST << MML_SPI_MR_SSL3_OFST ) //!< SSL3 mask

#define MML_SPI_MR_SSLx_MASK					( MML_SPI_MR_SSL1_MASK |\
													MML_SPI_MR_SSL2_MASK |\
													MML_SPI_MR_SSL3_MASK )

#define MML_SPI_MR_RFU_OFST						11 //!< RFU offset

/* Enumeration of the different value for a bits field . We recommend to use
 * human readable value. */
#define MML_SPI_MR_NUMBITS_2					0b000 //!< the field contains the number of bits to shift for each character transfer
#define MML_SPI_MR_NUMBITS_3					0b001
#define MML_SPI_MR_NUMBITS_4					0b010
#define MML_SPI_MR_NUMBITS_5					0b011

/* Enumeration of the different value for a bits field . We recommend to use
 * human readable value. */

