quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_spi_regs.h
#define MML_SPI_MR_SSV_0						0 //!< SSV='0'(asserts nSS low)
#define MML_SPI_MR_SSV_1						1 //!< SSV='1'(deasserts nSS low)

#define MML_SPI_MR_SSIO_0						0 //!< nSS = input
#define MML_SPI_MR_SSIO_1						1 //!< nSS = output

#define MML_SPI_MR_DIAG_0						0 //!< return SPI_BRG
#define MML_SPI_MR_DIAG_1						1 //!< return SPI Baud Rate Counter

#define MML_SPI_MR_TX_LJ_0						0 //!< transmit data loaded from fifo
#define MML_SPI_MR_TX_LJ_1						1 //!< transmit data is left justified as it is loaded
/** @} */ /* @defgroup MML_SPI_REGS_MR */

/** @defgroup MML_SPI_REGS_DSR Diagnostic State Register (DSR)
 *
 * @li SPISTATE [5:0]	- R: SPI state machine
 * @li TCKEN [6]		- R: transmit clock enable
 * @li SCKEN [7]		- R: shift clock enable
 * @li RFU [31:8]		- R: reserved
 * @{
 */
#define MML_SPI_DSR_OFST						0x00000010 //!< Register offset
#define MML_SPI_DSR_DFLT						0x00000000 //!< Register default value

/* Bits Fields */
#define MML_SPI_DSR_SPISTATE_OFST				0 //!< SPISTATE offset
#define MML_SPI_DSR_SPISTATE_MASK_NO_OFST		0x0000003f //!< SPISTATE mask no offset
#define MML_SPI_DSR_SPISTATE_MASK				( MML_SPI_DSR_SPISTATE_MASK_NO_OFST << MML_SPI_DSR_SPISTATE_OFST ) //!< SPISTATE mask

#define MML_SPI_DSR_TCKEN_OFST					6 //!< TCKEN offset
#define MML_SPI_DSR_TCKEN_MASK_NOOFST			0x1 //!< TCKEN mask no offset
#define MML_SPI_DSR_TCKEN_MASK					( MML_SPI_DSR_TCKEN_MASK_NOOFST << MML_SPI_DSR_TCKEN_OFST ) //!< TCKEN mask

#define MML_SPI_DSR_SCKEN_OFST					7 //!< SCKEN offset
#define MML_SPI_DSR_SCKEN_MASK_NOOFST			0x1 //!< SCKEN mask no offset
#define MML_SPI_DSR_SCKEN_MASK					( MML_SPI_DSR_SCKEN_MASK_NOOFST << MML_SPI_DSR_SCKEN_OFST ) //!< SCKEN mask

#define MML_SPI_DSR_RFU_OFST					8 //!< RFU offset

/* Enumeration of the different value for a bits field . We recommend to use
 * human readable value. */

#define MML_SPI_DSR_SPISTATE_0					0 //!< define the current state

#define MML_SPI_DSR_TCKEN_0						0 //!< transmit clock enable de-asserted
#define MML_SPI_DSR_TCKEN_1						1 //!< transmit clock enable asserted

#define MML_SPI_DSR_SCKEN_0						0 //!< shift clock enable de-asserted
#define MML_SPI_DSR_SCKEN_1						1 //!< shift clock enable-asserted
/** @} */ /* @defgroup MML_SPI_REGS_DSR */

/** @defgroup MML_SPI_REGS_BRR Baud Rate Register (BRR)
 *
 * @li BRG [15:0]	- R/W: baud rate reload value
 * @li RFU [31:16]	- R: reserved
 * @{
 */
#define MML_SPI_BRR_OFST						0x00000014 //!< Register offset
#define MML_SPI_BRR_DFLT						0x0000ffff //!< Register default value

/* Bits Fields */
#define MML_SPI_BRR_BRG_OFST					0 //!< BRG offset
#define MML_SPI_BRR_BRG_MASK_NOOFST				0xffff //!< BRG mask no offset
#define MML_SPI_BRR_BRG_MASK					( MML_SPI_BRR_BRG_MASK_NOOFST << MML_SPI_BRR_BRG_OFST ) //!< BRG mask

#define MML_SPI_BRR_RFU_OFST					16 //!< RFU offset
/** @} */ /* @defgroup MML_SPI_REGS_BRR */

/** @defgroup MML_SPI_REGS_DMAR DMA register (DMAR)
 *
 * @li TX_FIFO_LEVEL [1:0]	- R/W: put the bit request threhold
 * @li RFU1 [3:2]			- R: reserved
 * @li TX_FIFO_CLR [4]		- W/O: reset the bit
 * @li RFU2 [7:5]			- R: reserved
 * @li TX_FIFO_CNT [10:8]	- R: number of entries
 * @li RFU3 [14:11]			- R: reserved
 * @li TX_DMA_EN [15]		- R/W: used to enable/disable the bit
 * @li RX_FIFO_LEVEL [17:16]- R/W: put the bit request threshold
 * @li RFU4 [19:18]			- R: reserved
 * @li RX_FIFO_CLR [20]		- W/O: reset the bit
 * @li RFU5 [23:21]			- R: reserved
 * @li RX_FIFO_CNT [26:24]	- R: number of entries
 * @li RFU6 [30:27]			- R: reserved
 * @li RX_DMA_EN [31]		- R/W: Enables DMA for receive
 * @{
 */
#define MML_SPI_DMAR_OFST						0x00000018 //!< Register offset
#define MML_SPI_DMAR_DFLT						0x00030003 //!< Register default value

/* Bits Fields */
#define MML_SPI_DMAR_TX_FIFO_LVL_OFST			0 //!< TX_FIFO_LEVEL offset
#define MML_SPI_DMAR_TX_FIFO_LVL_MASK_NOOFST	0x3 //!< TX_FIFO_LEVEL mask no offset
#define MML_SPI_DMAR_TX_FIFO_LVL_MASK			( MML_SPI_DMAR_TX_FIFO_LVL_MASK_NOOFST << MML_SPI_DMAR_TX_FIFO_LVL_OFST ) //!< TX_FIFO_LEVEL mask

#define MML_SPI_DMAR_RFU1_OFST					2 //!< RFU1 offset

#define MML_SPI_DMAR_TX_FIFO_CLR_OFST			4 //!< TX_FIFO_CLR offset
#define MML_SPI_DMAR_TX_FIFO_CLR_MASK_NOOFST	0x1 //!< TX_FIFO_CLR mask no offset
#define MML_SPI_DMAR_TX_FIFO_CLR_MASK			( MML_SPI_DMAR_TX_FIFO_CLR_MASK_NOOFST << MML_SPI_DMAR_TX_FIFO_CLR_OFST ) //!< TX_FIFO_CLR mask

#define MML_SPI_DMAR_RFU2_OFST					5 //!< RFU2 offset

#define MML_SPI_DMAR_TX_FIFO_CNT_OFST			8 //!< TX_FIFO_CNT offset
#define MML_SPI_DMAR_TX_FIFO_CNT_MASK_NOOFST	0x7 //!< TX_FIFO_CNT mask no offset
#define MML_SPI_DMAR_TX_FIFO_CNT_MASK			( MML_SPI_DMAR_TX_FIFO_CNT_MASK_NOOFST << MML_SPI_DMAR_TX_FIFO_CNT_OFST ) //!< TX_FIFO_CNT mask

#define MML_SPI_DMAR_RFU3_OFST					11 //!< RFU3 offset

#define MML_SPI_DMAR_TX_DMA_EN_OFST				15 //!< TX_DMA_EN offset
#define MML_SPI_DMAR_TX_DMA_EN_MASK_NOOFST		0x1 //!< TX_DMA_EN mask no offset
#define MML_SPI_DMAR_TX_DMA_EN_MASK				( MML_SPI_DMAR_TX_DMA_EN_MASK_NOOFST << MML_SPI_DMAR_TX_DMA_EN_OFST ) //!< TX_DMA_EN mask

#define MML_SPI_DMAR_RX_FIFO_LVL_OFST			16 //!< RX_FIFO_LEVEL offset
#define MML_SPI_DMAR_RX_FIFO_LVL_MASK_NOOFST	0x3 //!< RX_FIFO_LEVEL mask no offset
#define MML_SPI_DMAR_RX_FIFO_LVL_MASK			( MML_SPI_DMAR_RX_FIFO_LVL_MASK_NOOFST << MML_SPI_DMAR_RX_FIFO_LVL_OFST ) //!< RX_FIFO_LEVEL mask

#define MML_SPI_DMAR_RFU4_OFST					18 //!< RFU4 offset

#define MML_SPI_DMAR_RX_FIFO_CLR_OFST			20 //!< RX_FIFO_CLR offset
#define MML_SPI_DMAR_RX_FIFO_CLR_MASK_NOOFST	0x1 //!< RX_FIFO_CLR mask no offset
#define MML_SPI_DMAR_RX_FIFO_CLR_MASK			( MML_SPI_DMAR_RX_FIFO_CLR_MASK_NOOFST << MML_SPI_DMAR_RX_FIFO_CLR_OFST ) //!< RX_FIFO_CLR mask

#define MML_SPI_DMAR_RFU5_OFST					21 //!< RFU5 offset

#define MML_SPI_DMAR_RX_FIFO_CNT_OFST			24 //!< RX_FIFO_CNT offset
#define MML_SPI_DMAR_RX_FIFO_CNT_MASK_NOOFST	0x7 //!< RX_FIFO_CNT mask no offset
#define MML_SPI_DMAR_RX_FIFO_CNT_MASK			( MML_SPI_DMAR_RX_FIFO_CNT_MASK_NOOFST << MML_SPI_DMAR_RX_FIFO_CNT_OFST ) //!< RX_FIFO_CNT mask

#define MML_SPI_DMAR_RFU6_OFST					27 //!< RFU6 offset

