quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_spi_regs.h
#define MML_SPI_DMAR_RX_DMA_EN_OFST				31 //!< RX_DMA_EN offset
#define MML_SPI_DMAR_RX_DMA_EN_MASK_NOOFST		0x1u //!< RX_DMA_EN mask no offset
#define MML_SPI_DMAR_RX_DMA_EN_MASK				( MML_SPI_DMAR_RX_DMA_EN_MASK_NOOFST << MML_SPI_DMAR_RX_DMA_EN_OFST ) //!< RX_DMA_EN mask

/* Enumeration of the different value for a bits field . We recommend to use
 * human readable value. */

#define MML_SPI_DMAR_TX_FIFO_LVL_0				0b00 //!< 1 free entry
#define MML_SPI_DMAR_TX_FIFO_LVL_1				0b01 //!< 2 free entries
#define MML_SPI_DMAR_TX_FIFO_LVL_2				0b10 //!< 3 free entries
#define MML_SPI_DMAR_TX_FIFO_LVL_3				0b11 //!< 4 free entries

#define MML_SPI_DMAR_TX_FIFO_CNT_0				0b000 //!< TxFIFO has 0 entries
#define MML_SPI_DMAR_TX_FIFO_CNT_1				0b001 //!< TxFIFO has 1 entry
#define MML_SPI_DMAR_TX_FIFO_CNT_2				0b010 //!< TxFIFO has 2 entries
#define MML_SPI_DMAR_TX_FIFO_CNT_3				0b011 //!< TxFIFO has 3 entries
#define MML_SPI_DMAR_TX_FIFO_CNT_4				0b100 //!< TxFIFO has 4 entries

#define MML_SPI_DMAR_RX_FIFO_LVL_0				0b00 //!< request RxDMA when RxFIFO has 1 entry
#define MML_SPI_DMAR_RX_FIFO_LVL_1				0b01 //!< request RxDMA when RxFIFO has 2 entries
#define MML_SPI_DMAR_RX_FIFO_LVL_2				0b10 //!< request RxDMA when RxFIFO has 3 entries
#define MML_SPI_DMAR_RX_FIFO_LVL_3				0b11 //!< request RxDMA when RxFIFO has 4 entries

#define MML_SPI_DMAR_RX_FIFO_CNT_0				0b000 //!< RxFIFO has 0 entries
#define MML_SPI_DMAR_RX_FIFO_CNT_1				0b001 //!< RxFIFO has 1 entry
#define MML_SPI_DMAR_RX_FIFO_CNT_2				0b010 //!< RxFIFO has 2 entries
#define MML_SPI_DMAR_RX_FIFO_CNT_3				0b011 //!< RxFIFO has 3 entries
#define MML_SPI_DMAR_RX_FIFO_CNT_4				0b100 //!< RxFIFO has 4 entries

#define MML_SPI_DMAR_TX_FIFO_CLR_0				0 //!< Nothing
#define MML_SPI_DMAR_TX_FIFO_CLR_1				1 //!< Reset
#define MML_SPI_DMAR_TX_DMA_EN_DISABLE			0 //!< TX DMA disable
#define MML_SPI_DMAR_TX_DMA_EN_ENABLE			1 //!< TX DMA enable
#define MML_SPI_DMAR_RX_FIFO_CLR_0				0 //!< Nothing
#define MML_SPI_DMAR_RX_FIFO_CLR_1				1 //!< Reset
#define MML_SPI_DMAR_RX_DMA_EN_DISABLE			0 //!< RX DMA disable
#define MML_SPI_DMAR_RX_DMA_EN_ENABLE			1 //!< RX DMA enable
/** @} */ /* @defgroup MML_SPI_REGS_DMAR */

/** @defgroup MML_SPI_REGS_MCR Mode Control Register (MCR)
 *
 * @li I2S_EN [0]	- R/W: I2S mode enable
 * @li I2S_MUTE [1]	- R/W: I2S mute transmit
 * @li I2S_PAUSE [2]- R/W: I2S pause transmit/receive
 * @li I2S_MONO [3]	- R/W: I2S mono audio mode
 * @li I2S_LJ [4]	- R/W: I2S left justify
 * @li RFU [31:5]	- R: reserved
 * @{
 */
#define MML_SPI_MCR_OFST						0x0000001c //!< Register offset
#define MML_SPI_MCR_DFLT						0x00000000 //!< Register default value

/* Bits Fields */
#define MML_SPI_MCR_I2S_EN_OFST					0 //!< I2S_EN offset
#define MML_SPI_MCR_I2S_EN_MASK_NOOFST			0x1 //!< I2S_EN mask no offset
#define MML_SPI_MCR_I2S_EN_MASK					( MML_SPI_MCR_I2S_EN_MASK_NOOFST << MML_SPI_MCR_I2S_EN_OFST ) //!< I2S_EN mask

#define MML_SPI_MCR_I2S_MUTE_OFST				1 //!< I2S_MUTE offset
#define MML_SPI_MCR_I2S_MUTE_MASK_NOOFST		0x1 //!< I2S_MUTE mask no offset
#define MML_SPI_MCR_I2S_MUTE_MASK				( MML_SPI_MCR_I2S_MUTE_MASK_NOOFST << MML_SPI_MCR_I2S_MUTE_OFST ) //!< I2S_MUTE mask

#define MML_SPI_MCR_I2S_PAUSE_OFST				2 //!< I2S_PAUSE offset
#define MML_SPI_MCR_I2S_PAUSE_MASK_NOOFST		0x1 //!< I2S_PAUSE mask no offset
#define MML_SPI_MCR_I2S_PAUSE_MASK				( MML_SPI_MCR_I2S_PAUSE_MASK_NOOFST << MML_SPI_MCR_I2S_PAUSE_OFST ) //!< I2S_PAUSE mask

#define MML_SPI_MCR_I2S_MONO_OFST				3 //!< I2S_MONO offset
#define MML_SPI_MCR_I2S_MONO_MASK_NOOFST		0x1 //!< I2S_MONO mask no offset
#define MML_SPI_MCR_I2S_MONO_MASK				( MML_SPI_MCR_I2S_MONO_MASK_NOOFST << MML_SPI_MCR_I2S_MONO_OFST ) //!< I2S_MONO mask

#define MML_SPI_MCR_I2S_LJ_OFST					4 //!< I2S_LJ offset
#define MML_SPI_MCR_I2S_LJ_MASK_NOOFST			0x1 //!< I2S_LJ mask no offset
#define MML_SPI_MCR_I2S_LJ_MASK					( MML_SPI_MCR_I2S_LJ_MASK_NOOFST << MML_SPI_MCR_I2S_LJ_OFST ) //!< I2S_LJ mask

#define MML_SPI_MCR_RFU_OFST					5 //!< RFU offset


/* Enumeration of the different value for a bits field . We recommend to use
 * human readable value. */

#define MML_SPI_MCR_I2S_EN_DISABLE				0 //!<disable mode
#define MML_SPI_MCR_I2S_EN_ENABLE				1 //!<enable mode

#define MML_SPI_MCR_I2S_MUTE_0					0 //!<normal transmit/receive
#define MML_SPI_MCR_I2S_MUTE_1					1 //!<transmit '0'

#define MML_SPI_MCR_I2S_PAUSEL_0				0 //!<normal transmit/receive
#define MML_SPI_MCR_I2S_PAUSEL_1				1 //!<halt transmit and receive FIFO&DMA

#define MML_SPI_MCR_I2S_MONO_0					0 //!<stereo mode
#define MML_SPI_MCR_I2S_MONO_1					1 //!<mono mode

#define MML_SPI_MCR_I2S_LJ_0					0 //!<normal I2S audio protocol
#define MML_SPI_MCR_I2S_LJ_1					1 //!<audio data is in sync with nSS

/** @} */ /* @defgroup MML_SPI_REGS_MCR */


#ifndef __ASSEMBLER__
/* -------------------------------------------------------------------------- */
/** SPI Registers.
 *
 */
typedef volatile struct
{
	/** Data register */
	unsigned int								dr;
	/** Control register */
	unsigned int								cr;
	/** Status register */
	unsigned int								sr;
	/** Mode register */
	unsigned int								mr;
	/** Diagnostic state register */
	unsigned int								dsr;
	/** Baud rate register */
	unsigned int								brr;
	/** Dma register */
	unsigned int								dmar;
	/** I2S control register */
	unsigned int								i2s_cr;

} mml_spi_regs_t;
#endif /* __ASSEMBLER__ */

/** @} */ /* @defgroup MML_SPI_REGS */

#endif /* _MML_SPI_REGS_H_ */

/******************************************************************************/
/* EOF */
